{
  "templateVersion": "cobranca_v1_2",
  "language": "pt-BR",
  "style": {
    "tone": "formal, técnico, objetivo, conservador",
    "constraints": [
      "não inventar informações",
      "não criar datas, números de contrato, documentos, valores ou eventos não fornecidos",
      "não citar jurisprudência específica ou números de processos",
      "não presumir forma de pagamento, juros ou vencimento sem input",
      "não criar tentativas extrajudiciais inexistentes",
      "usar redação clara, impessoal e precisa",
      "qualquer dado ausente deve ser marcado com [PENDENTE – INFORMAÇÃO NÃO FORNECIDA]"
    ]
  },
  "structure": [
    "Endereçamento",
    "Qualificação das Partes",
    "Dos Fatos",
    "Do Direito",
    "Dos Pedidos",
    "Do Valor da Causa",
    "Requerimentos Finais"
  ],
  "sectionGuidance": {
    "enderecamento": {
      "minParagraphs": 1,
      "maxParagraphs": 1,
      "notes": "Endereçar exatamente o juízo informado; se faltar, inserir [PENDENTE – INFORMAÇÃO NÃO FORNECIDA]."
    },
    "qualificacao": {
      "minParagraphs": 1,
      "maxParagraphs": 3,
      "notes": "Usar somente dados fornecidos; RG, e-mail ou telefone ausentes devem ser marcados como pendentes."
    },
    "fatos": {
      "minParagraphs": 1,
      "maxParagraphs": 3,
      "notes": "Narração objetiva e cronológica, sem adicionar valores ou datas não fornecidos. Tentativas extrajudiciais só se descritas no input."
    },
    "direito": {
      "minParagraphs": 3,
      "maxParagraphs": 6,
      "structure": [
        "Natureza da obrigação e sua exigibilidade (obrigação de pagar quantia certa)",
        "Configuração da mora/inadimplemento e seus efeitos",
        "Base legal mínima no Código Civil (mencionar expressamente os arts. 389, 395 e 397)",
        "Base legal mínima no CPC (mencionar expressamente arts. 319 e 373; e, se compatível com o caso, art. 85 para honorários)",
        "Adequação da via eleita e coerência com os pedidos"
      ],
      "rules": [
        "O texto desta seção deve ser intitulado e referenciado como 'Do Direito' (não usar títulos alternativos como 'Fundamentos Jurídicos')",
        "Cada parágrafo deve tratar exclusivamente de um item da estrutura",
        "É vedada repetição de ideias entre parágrafos",
        "Não citar números de processos ou acórdãos",
        "Deve citar explicitamente os artigos mínimos: CC 389, 395, 397 e CPC 319, 373 (sem extrapolar para legislação extravagante)",
        "Se faltarem dados para afirmar algo específico, declarar como [PENDENTE – INFORMAÇÃO NÃO FORNECIDA] e manter a fundamentação em nível geral"
      ]
    },
    "pedidos": {
      "minParagraphs": 1,
      "maxParagraphs": 3,
      "notes": "Pedidos claros: citação, condenação, encargos legais, custas, honorários e produção de provas. Se houver inconsistência nos dados, sinalizar com [ALERTA – …]."
    },
    "valor_causa": {
      "minParagraphs": 1,
      "maxParagraphs": 1,
      "notes": "Usar rigorosamente o valor fornecido. Se houver divergência com o valor dos fatos, inserir [ALERTA – Divergência entre valor da causa e narrativa]."
    },
    "requerimentos_finais": {
      "minParagraphs": 1,
      "maxParagraphs": 3,
      "notes": "Fecho padrão com protesto por provas. Local e data devem ser [PENDENTE – …] se não fornecidos."
    }
  },
  "legalGuidance": {
    "defaultBasis": [
      "obrigação de pagar quantia certa e perdas e danos em caso de inadimplemento (Código Civil, arts. 389, 395 e 397)",
      "mora e inadimplemento, com cabimento de correção monetária e juros legais (sem fixar índice/termo inicial sem input)",
      "requisitos formais da petição inicial e ônus da prova (CPC, arts. 319 e 373)",
      "honorários sucumbenciais apenas como pedido, sem quantificação sem base (CPC, art. 85)"
    ],
    "doNotDo": [
      "não criar números de contrato ou recibos",
      "não presumir juros, índices, datas ou prazos",
      "não afirmar protesto ou negativação sem informação explícita",
      "não incluir narrativa ofensiva ou especulativa"
    ]
  },
  "placeholders": {
    "pending": "[PENDENTE – INFORMAÇÃO NÃO FORNECIDA]",
    "inconsistency": "[ALERTA – INCONSISTÊNCIA IDENTIFICADA]"
  },
  "runtime": {
    "supportsDynamicParagraphValidation": true,
    "strictOutput": true,
    "allowExpandableModel": false,
    "maxHallucinationTolerance": 0
  },
  "compatibility": {
    "minModel": "gpt-4o",
    "recommendedModel": "gpt-5.1",
    "pipeline": "validalex_cobranca_v2",
    "modules": [
      "buildPrompt.js >= v2.0",
      "parseModel.js >= v2.0",
      "assemble.js >= v2.0",
      "validate.js >= v2.0"
    ]
  }
}
